# -*- coding: utf-8 -*-

"""回文检查
https://wizardforcel.gitbooks.io/the-art-of-programming-by-july/content/01.04.html

回文检查:
方法一：将链表翻转，比较两个链表
方法二：利用快慢指针找到中点，利用栈数据结构比较

方法一：将链表翻转，比较两个链表
原始链表:      1 -> 2 -> 3 -> 4 -> 3 -> 2 -> 1
翻转之后的链表: 1 -> 2 -> 3 -> 4 -> 3 -> 2 -> 1


方法二：利用快慢指针找到中点，利用栈数据结构比较
回文奇数个
1 -> 2 -> 3 -> 4 -> 3 -> 2 -> 1
fast: 1 -> 3 -> 3 -> 1 -> None
slow: 1 -> 2 -> 3 -> 4 -> 3

链表：1 -> 2 -> 3 -> 4 -> 3 -> 2 -> 1
                         ^
栈：1 2 3 4

回文偶数个
1 -> 2 -> 3 -> 3 -> 2 -> 1
fast: 1 -> 3 -> 2 -> None
slow: 1 -> 2 -> 3 -> 3

链表：1 -> 2 -> 3 -> 3 -> 2 -> 1
                    ^

栈：1 2 3

"""
