#!/usr/bin/env python3
# -*- coding: utf-8 -*-

r"""
https://www.bilibili.com/video/av19177565/

treap = tree + heap

键值:   key  => 满足二叉查找树 BST 的规则
优先级: prior = random()  => 满足最小堆的规则

示例:

        G-4
     /      \
   B-7      H-5
  /   \      \
A-10 E-23    K-65
             /
           I-73

所有 key 都不相同
所有 prior 都不相同


插入操作:

(key, random())
1、给定 key，随机生成 prior
2、使用 key 根据二叉查找树 BST 的规则插入到叶子节点
3、使用 prior 根据最小堆的规则进行调整，也就是左旋或者右旋

插入 C-25
        G-4
     /      \
   B-7      H-5
  /   \      \
A-10 E-23    K-65
     /        /
    C-25    I-73

插入 D-9
        G-4
     /      \
   B-7      H-5
  /   \      \
A-10 E-23    K-65
     /        /
    C-25    I-73
     \
     D-9

C-25 左旋
        G-4
     /      \
   B-7      H-5
  /   \      \
A-10 E-23    K-65
     /        /
    D-9     I-73
     /
   C-25

E-23 右旋
        G-4
     /      \
   B-7      H-5
  /    \      \
A-10   D-9    K-65
      /  \      /
    C-25 E-23  I-73

插入 F-2
        G-4
     /      \
   B-7      H-5
  /    \      \
A-10   D-9    K-65
      /  \      /
    C-25 E-23  I-73
           \
           F-2

E-23 左旋
        G-4
     /      \
   B-7      H-5
  /    \      \
A-10   D-9    K-65
      /  \      /
    C-25 F-2  I-73
          /
        E-23

D-9 左旋
        G-4
     /      \
   B-7      H-5
  /    \      \
A-10   F-2    K-65
      /        /
     D-9     I-73
     / \
   C-25 E-23

B-7 左旋
        G-4
     /      \
   F-2      H-5
    /         \
   B-7        K-65
  /  \          /
A-10 D-9       I-73
     / \
  C-25 E-23

G-4 右旋
     F-2
    /    \
   B-7   G-4
  /  \     \
A-10 D-9   H-5
     / \     \
  C-25 E-23  K-65
              /
            I-73

删除操作:

1、将删除节点的 prior 变为无穷大
2、调整该节点的位置，也就是通过左右旋转下沉到叶子节点
3、删除该节点

删除 B-7

     F-2
    /    \
 B-max   G-4
  /  \     \
A-10 D-9   H-5
     / \     \
  C-25 E-23  K-65
              /
            I-73

B-max 左旋

     F-2
    /    \
   D-9    G-4
  /   \     \
B-max E-23  H-5
  /  \       \
A-10 C-25    K-65
              /
            I-73

B-max 右旋

     F-2
    /    \
   D-9    G-4
  /   \     \
A-10 E-23  H-5
  \         \
 B-max     K-65
     \       /
    C-25    I-73

B-max 左旋

     F-2
    /    \
   D-9    G-4
  /   \     \
A-10 E-23  H-5
  \         \
 C-25     K-65
   /        /
 B-max    I-73

     F-2
    /    \
   D-9    G-4
  /   \     \
A-10 E-23  H-5
  \         \
 C-25     K-65
            /
          I-73

"""