#!/usr/bin/env python3
# -*- coding: utf-8 -*-

r"""
https://juejin.im/post/5d88f5366fb9a06afd6644c7
https://zhuanlan.zhihu.com/p/53262788

[7, 1, 5, 3, 6, 4]

解法一：暴力解法
[7, 1, 5, 3, 6, 4]
            1  2  3  4  5  6
第一天买进 7    -6 -2 -4 -1 -3
第二天买进 1        4  2  5  3
第三天买进 5          -2  1 -1
第四天买进 3              3  1
第五天买进 6                -2
第六天买进 4


解法二：
[7, 1, 5, 3, 6, 4]

    -7(买)
   /     \
-6(卖) -7(保持不变)
           /     \
        -2(卖) -7(保持不变)
                  /     \
              -4(卖) -7(保持不变)
                       /     \
                   -1(卖) -7(保持不变)
                           /     \
                        -3(卖) -7(保持不变)




                    0(保持不变)
        /                                 \
    -1(买)                               0(保持不变)
   /     \                      /                          \
4(卖) -1(保持不变)           -5(买)                          0(保持不变)
        /     \            /    \                   /                            \
      2(卖) -1(保持不变) -2(卖) -5(保持不变)        -3(买)                         0(保持不变)
              /    \           /      \         /     \                    /                \
           5(卖) -1(保持不变)  1(卖) -5(保持不变) 3(卖) -3(保持不变)         -6(买)            0(保持不变)
                  /     \          /      \          /      \          /      \           /     \
               3(卖) -1(保持不变) -1(卖) -5(保持不变)  1(卖) -3(保持不变)  -2(卖) -6(保持不变) -4(买) 0(保持不变)


"""
